#### 2019년 외래관광객 실태조사 ####

# 2019년 외래관광객 실태조사를 활용하여 지역 별 관광객을 나타내는 변수 생성 #

year <- rep(2019, 12*17)
month <- rep(1:12, 17)
sido <- rep(c('강원', '경기', '경남', '경북', '광주', '대구', '대전', '부산', '서울', '세종', '울산',
'인천', '전남', '전북', '제주', '충남', '충북'), each=12)

gangwon <- c(173,178,153,171,118,114,115,133,171,190,150,202)
gyeongi <- c(250,244,231,284,241,246,289,252,297,280,212,226)
gyeongnam <- c(31,30,26,35,40,30,36,22,30,36,33,22)
gyeongbuk <- c(59,43,32,44,53,56,42,51,42,57,46,32)
gwangju <- c(16,17,14,14,19,23,48,18,16,11,21,7)
daegu <- c(49,46,39,38,42,45,56,54,57,58,53,54)
daejeon <- c(18,31,17,22,23,30,13,31,22,21,24,20)
busan <- c(202,194,175,208,248,234,223,224,236,225,203,194)
seoul <- c(1096,1105,1147,1137,1057,1080,1028,1019,1035,1033,978,962)
sejong <- c(6,9,3,9,8,5,5,9,4,3,2,6)
ulsan <- c(25,19,4,10,21,23,20,22,19,13,19,18)
incheon <- c(124,122,88,80,110,107,113,123,117,116,101,121)
jeonnam <- c(14,11,4,16,15,20,19,13,16,14,6,8)
jeonbuk <- c(17,20,13,22,29,19,26,36,33,42,19,10)
jeju <- c(89,81,89,115,106,105,119,112,122,125,108,108)
chungnam <- c(21,26,9,21,20,14,28,19,16,14,13,25)
chungbuk <- c(21,11,12,11,12,10,17,16,6,18,11,13)
total <- c(gangwon,gyeongi,gyeongnam,gyeongbuk,gwangju,daegu,daejeon,busan,seoul,sejong,ulsan,incheon,jeonnam ,jeonbuk,jeju,chungnam,chungbuk)

df <- data.frame(year, month, sido, total)

write.csv(df, file='2019년_외래관광객조사_통계표/외래관광객.csv')
